; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-2-7)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	)
(:init
	(at plane1 city5)
	(= (capacity plane1) 10620)
	(= (fuel plane1) 4092)
	(= (slow-burn plane1) 5)
	(= (fast-burn plane1) 19)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 5)
	(at plane2 city3)
	(= (capacity plane2) 7365)
	(= (fuel plane2) 2698)
	(= (slow-burn plane2) 3)
	(= (fast-burn plane2) 11)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 4)
	(at person1 city6)
	(at person2 city6)
	(at person3 city4)
	(at person4 city1)
	(at person5 city2)
	(at person6 city5)
	(at person7 city1)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 762)
	(= (distance city0 city2) 718)
	(= (distance city0 city3) 535)
	(= (distance city0 city4) 590)
	(= (distance city0 city5) 583)
	(= (distance city0 city6) 851)
	(= (distance city0 city7) 554)
	(= (distance city1 city0) 762)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 898)
	(= (distance city1 city3) 830)
	(= (distance city1 city4) 715)
	(= (distance city1 city5) 899)
	(= (distance city1 city6) 564)
	(= (distance city1 city7) 503)
	(= (distance city2 city0) 718)
	(= (distance city2 city1) 898)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 886)
	(= (distance city2 city4) 581)
	(= (distance city2 city5) 520)
	(= (distance city2 city6) 904)
	(= (distance city2 city7) 848)
	(= (distance city3 city0) 535)
	(= (distance city3 city1) 830)
	(= (distance city3 city2) 886)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 854)
	(= (distance city3 city5) 804)
	(= (distance city3 city6) 735)
	(= (distance city3 city7) 792)
	(= (distance city4 city0) 590)
	(= (distance city4 city1) 715)
	(= (distance city4 city2) 581)
	(= (distance city4 city3) 854)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 516)
	(= (distance city4 city6) 707)
	(= (distance city4 city7) 730)
	(= (distance city5 city0) 583)
	(= (distance city5 city1) 899)
	(= (distance city5 city2) 520)
	(= (distance city5 city3) 804)
	(= (distance city5 city4) 516)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 849)
	(= (distance city5 city7) 877)
	(= (distance city6 city0) 851)
	(= (distance city6 city1) 564)
	(= (distance city6 city2) 904)
	(= (distance city6 city3) 735)
	(= (distance city6 city4) 707)
	(= (distance city6 city5) 849)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 876)
	(= (distance city7 city0) 554)
	(= (distance city7 city1) 503)
	(= (distance city7 city2) 848)
	(= (distance city7 city3) 792)
	(= (distance city7 city4) 730)
	(= (distance city7 city5) 877)
	(= (distance city7 city6) 876)
	(= (distance city7 city7) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city3)
	(at person1 city6)
	(at person2 city2)
	(at person3 city0)
	(at person4 city3)
	(at person5 city1)
	(at person6 city1)
	(at person7 city7)
	))

(:metric minimize (+ (* 3 (total-time))  (* 1 (total-fuel-used))))
)

; plan
1. (fly plane2 city3 city6)
   deleted: (at plane2 city3)
   added: (at plane2 city6)
   changed: (total-fuel-used) from 0 to 2205, (fuel plane2) from 2698 to 493
   goals met: 1 of 8
2. (board person2 plane2 city6)
   deleted: (at person2 city6)
   added: (in person2 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 1 of 8
3. (board person6 plane1 city5)
   deleted: (at person6 city5)
   added: (in person6 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 1 of 8
4. (fly plane1 city5 city0)
   deleted: (at plane1 city5)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 2205 to 5120, (fuel plane1) from 4092 to 1177
   goals met: 1 of 8
5. (refuel plane1 city0)
   changed: (fuel plane1) from 1177 to 10620
   goals met: 1 of 8
6. (refuel plane2 city6)
   changed: (fuel plane2) from 493 to 7365
   goals met: 1 of 8
7. (fly plane2 city6 city2)
   deleted: (at plane2 city6)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 5120 to 7832, (fuel plane2) from 7365 to 4653
   goals met: 1 of 8
8. (debark person2 plane2 city2)
   deleted: (in person2 plane2)
   added: (at person2 city2)
   changed: (onboard plane2) from 1 to 0
   goals met: 2 of 8
9. (board person5 plane2 city2)
   deleted: (at person5 city2)
   added: (in person5 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 2 of 8
10. (fly plane2 city2 city1)
   deleted: (at plane2 city2)
   added: (at plane2 city1)
   changed: (total-fuel-used) from 7832 to 10526, (fuel plane2) from 4653 to 1959
   goals met: 2 of 8
11. (debark person5 plane2 city1)
   deleted: (in person5 plane2)
   added: (at person5 city1)
   changed: (onboard plane2) from 1 to 0
   goals met: 3 of 8
12. (fly plane1 city0 city3)
   deleted: (at plane1 city0)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 10526 to 13201, (fuel plane1) from 10620 to 7945
   goals met: 4 of 8
13. (board person7 plane2 city1)
   deleted: (at person7 city1)
   added: (in person7 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 4 of 8
14. (fly plane2 city1 city7)
   deleted: (at plane2 city1)
   added: (at plane2 city7)
   changed: (total-fuel-used) from 13201 to 14710, (fuel plane2) from 1959 to 450
   goals met: 4 of 8
15. (debark person7 plane2 city7)
   deleted: (in person7 plane2)
   added: (at person7 city7)
   changed: (onboard plane2) from 1 to 0
   goals met: 5 of 8
16. (fly plane1 city3 city1)
   deleted: (at plane1 city3)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 14710 to 18860, (fuel plane1) from 7945 to 3795
   goals met: 4 of 8
17. (board person4 plane1 city1)
   deleted: (at person4 city1)
   added: (in person4 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 4 of 8
18. (refuel plane1 city1)
   changed: (fuel plane1) from 3795 to 10620
   goals met: 4 of 8
19. (debark person6 plane1 city1)
   deleted: (in person6 plane1)
   added: (at person6 city1)
   changed: (onboard plane1) from 2 to 1
   goals met: 5 of 8
20. (fly plane1 city1 city4)
   deleted: (at plane1 city1)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 18860 to 22435, (fuel plane1) from 10620 to 7045
   goals met: 5 of 8
21. (board person3 plane1 city4)
   deleted: (at person3 city4)
   added: (in person3 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 5 of 8
22. (fly plane1 city4 city0)
   deleted: (at plane1 city4)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 22435 to 25385, (fuel plane1) from 7045 to 4095
   goals met: 5 of 8
23. (debark person3 plane1 city0)
   deleted: (in person3 plane1)
   added: (at person3 city0)
   changed: (onboard plane1) from 2 to 1
   goals met: 6 of 8
24. (fly plane1 city0 city3)
   deleted: (at plane1 city0)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 25385 to 28060, (fuel plane1) from 4095 to 1420
   goals met: 7 of 8
25. (debark person4 plane1 city3)
   deleted: (in person4 plane1)
   added: (at person4 city3)
   changed: (onboard plane1) from 1 to 0
   goals met: 8 of 8
